AUTO_config_TK_pesok/src/DataProcessors/ВосстановлениеПоследовательности/ВосстановлениеПоследовательности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВосстановлениеПоследовательности</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Enums/ВидыПоследовательности/ВидыПоследовательности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПоследовательности</name>
  <enumValues>
    <name>ПартииТоваров</name>
  </enumValues>
  <enumValues>
    <name>Взаиморасчеты</name>
  </enumValues>
  <enumValues>
    <name>ПартииОрганизаций</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/DataProcessors/ВосстановлениеПоследовательности/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры



&НаСервере
Процедура ТестНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//ОбработкаОбъект.ТестПроведения();
	
	ОбработкаОбъект.ЗапуститьФоновоеВосстановлениеПартииОрганизаций(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестВзаиморасчетыНаСервере()
	
	ОбработкаОбъект = Обработки.ВосстановлениеПоследовательности.Создать();
	ОбработкаОбъект.ЗапуститьФоновоеВосстановлениеВзаиморасчеты(Неопределено);


КонецПроцедуры

&НаКлиенте
Процедура ТестВзаиморасчеты(Команда)
	ТестВзаиморасчетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)
	
	ВидУчетаПриИзмененииФрагмент();
		
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзмененииФрагмент()экспорт
	
	Если ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыПоследовательности.ПартииТоваров") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Склад","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Договор","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Организация","Видимость",Ложь);
	ИначеЕсли  ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыПоследовательности.Взаиморасчеты") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Договор","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Склад","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Организация","Видимость",Ложь);
	ИначеЕсли  ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыПоследовательности.ПартииОрганизаций") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Организация","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Склад","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Договор","Видимость",Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидУчетаПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаДокумент) Тогда
		Сообщить("Не указана дата");
		Возврат;
	КонецЕсли;
	
	ИзменитьГраницу();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьГраницу()
	
	ПустойМоментВремени = Новый МоментВремени('00010101', Неопределено);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПроведенВХронологическойПоследовательности",Ложь);

	Если ВидУчета = Перечисления.ВидыПоследовательности.ПартииТоваров Тогда
		ИмяПоследовательности = "ПартииТоваров";
		парамОтбор = Склад;
		СтруктураОтбора.Вставить("СкладКомпании",Склад);
	ИначеЕсли  ВидУчета = Перечисления.ВидыПоследовательности.ПартииОрганизаций Тогда
		ИмяПоследовательности = "ПартииОрганизаций";
		парамОтбор = Организация;
		СтруктураОтбора.Вставить("Организация",Организация);

	ИначеЕсли  ВидУчета = Перечисления.ВидыПоследовательности.Взаиморасчеты Тогда
		ИмяПоследовательности = "Взаиморасчеты";
		парамОтбор = Договор;
		СтруктураОтбора.Вставить("ДоговорКонтрагента",Договор);

	КонецЕсли;	
	
	Если ТипЗнч(ДатаДокумент) = Тип("Дата") Тогда
		МоментВремениДокумента = Новый МоментВремени(ДатаДокумент);
	Иначе
		МоментВремениДокумента = Новый МоментВремени(ДатаДокумент.Дата, ДатаДокумент);
	КонецЕсли; 

	НачатьТранзакцию();
	
	//ТекущаяГраница = УправлениеПоследовательностями.ПолучитьГраницуПоследовательности(ВидУчета,парамОтбор);
	
	Если ЗначениеЗаполнено(парамОтбор) Тогда
		Последовательности[ИмяПоследовательности].УстановитьГраницу(МоментВремениДокумента,СтруктураОтбора);
	КонецЕсли;
	УправлениеПоследовательностями.ЗаполнитьИзмерениеПроведенВХронологическойПоследовательности(ВидУчета,МоментВремениДокумента.Дата,парамОтбор);
	
	ЗафиксироватьТранзакцию();

	
КонецПроцедуры
